AddParts.xml

<?xml version="1.0" encoding="UTF-8"?><soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/">
  <soapenv:Header>
    <wsse:Security xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd">
      <wsse:UsernameToken wsu:Id="UsernameToken-2">
        <wsse:Username>Admin.User</wsse:Username>
        <wsse:Password Type="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-username-token-profile-1.0#PasswordText">Bajaj@123</wsse:Password>
      </wsse:UsernameToken>
    </wsse:Security>
  </soapenv:Header>
  <soapenv:Body>
    <bm:addParts xmlns:bm="http://xmlns.oracle.com/cpqcloud/parts">
      <bm:Parts>
        <bm:each_record>
          <bm:company_associations/>
          <bm:part_number>020008</bm:part_number> <!-- Item Code-->
          <bm:description> <!-- Item Description -->
            <bm:en>BJLM 211</bm:en>
            </bm:description>
          <bm:_part_custom_field1>Modern Workspace Lighting</bm:_part_custom_field1> <!-- Product Group-->
          <bm:_part_custom_field2>FG</bm:_part_custom_field2>   <!-- 	Item Type -->
          <bm:_part_custom_field9>Each</bm:_part_custom_field9>  <!--Primary Unit of Measure -->
          <bm:_part_custom_field10>IMO</bm:_part_custom_field10>  <!-- Organization Code -->
          <bm:_part_custom_field11>PHASED OUT</bm:_part_custom_field11> <!-- 	Inventory Item Status Code -->
          <bm:_part_custom_field12>Illumination S</bm:_part_custom_field12> <!-- Business Unit -->
          <bm:_part_custom_field13>Luminaires</bm:_part_custom_field13> <!-- Segment -->
          <bm:_part_custom_field14>Commercial Lighting</bm:_part_custom_field14> <!-- Type -->
          <bm:_part_custom_field15>BJLM</bm:_part_custom_field15> <!-- 	Sub Type -->
          <bm:_part_custom_field18>Indian</bm:_part_custom_field18> <!-- Source -->
          <bm:_part_custom_field19>No Sub Brand</bm:_part_custom_field19> <!-- 	Sub Brand -->
          <bm:_part_custom_field20>HPMV</bm:_part_custom_field20> <!-- 	Attribute1 -->
          <bm:_part_custom_field21>2 x 11W</bm:_part_custom_field21> <!-- 	Attribute2 -->
          <bm:_part_custom_field22>MAGNETIC</bm:_part_custom_field22> <!-- 	Attribute3 -->
          
        </bm:each_record>
      </bm:Parts>
    </bm:addParts>
  </soapenv:Body>
</soapenv:Envelope>